using HW_ASP_7._6.Models;
using Microsoft.AspNetCore.Mvc;
using System.Collections.Generic;
using System.Linq;

namespace HW_ASP_7._6.Controllers
{
    public class NewsController : Controller
    {
        private static List<News> _newsList = new()
    {
        new News { Id = 1, Title = "Лучшие праздничные мультфильмы, без которых невозможно представить.", Content = "\"Ужас перед Рождеством\" (1993)\r\n\r\nВ городе кошмаров и страхов под названием Хэллоуин живут монстры, призраки и мертвецы. Их задача – пугать людей в ночь праздника. Джек Скеллингон устал от того, как одинаково проходит каждый год этот день. Вдруг он находит поляну, на которой находит вход в другой город – Рождество. Увидев такое количество радости и счастья, он решает стать Санта Клаусом.\r\n\r\nЭто нетипичный, но магический фильм Тима Бертона, который становится словно на грани эстетики Хэллоуина и праздничного настроения Рождества – и там, и там он стал классикой. Ведь соединил мрачность и очарование, глубокие смыслы и увлекательный сюжет.\r\n\r\n", Date = DateTime.Now.AddDays(-1) },
        new News { Id = 2, Title = "«Сантастрофа»: Airbnb показал нелегкую работу Санта Клауса", Content = "В рождественской кампании сервис Airbnb показал преимущества бронирования на праздники дома — Санта Клаус до вас точно доберется и оставит подарки.\r\n\r\nВ праздничном ролике компания в шуточной анимированной форме продемонстрировала нелегкую работу Санта Клауса по доставке подарков постояльцам гостиниц: вместо привычного дымохода ему приходится протискиваться через узкую вентиляцию, толкаться в лифте, пытаться проникать в номера.\r\n\r\nВ то время как Airbnb предлагает «дружелюбные» к Санте дома, в них все готово ко встрече праздника и главного рождественского волшебника. ", Date = DateTime.Now.AddDays(-2) },
        new News { Id = 3, Title = "Трейлер фильма «Кодовое имя «Красный» ", Content = "«Сант-Клаус — кодовое имя «Красный» — был похищен. Начальник службы безопасности Северного полюса (Дуэйн Джонсон) должен объединиться с самым известным в мире охотником за головами (Крис Эванс). Вместе они начинают бурную кругосветную миссию, чтобы спасти Рождество».", Date = DateTime.Now.AddDays(-3) }
    };

        public IActionResult Index()
        {
            return View(_newsList);
        }

        public IActionResult Details(int id)
        {
            var newsItem = _newsList.FirstOrDefault(n => n.Id == id);
            if (newsItem == null)
            {
                return NotFound();
            }
            return View(newsItem);
        }
    }
}
